# Inspecting data

In [1]:
import pandas as pd 
import numpy as np

In [4]:
df = pd.read_csv("P87-Section-2-Dataset-Basics-Resources\\P87-S2-Dataset-Basics-Resources\\astronauts.csv")
df.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,5/17/1967,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaN,NaN
1,Loren W. Acton,NaN,NaN,Retired,3/7/1936,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaN,NaN
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,5/20/1951,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaN,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1/20/1930,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaN,NaN

In [5]:
# random sample of data

df.sample(3)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
2,James C. Adamson,1984.0,10.0,Retired,3/3/1946,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaN,NaN
207,Stanley G. Love,1998.0,17.0,Management,6/8/1965,"San Diego, CA",Male,Harvey Mudd College; University of Washington,Physics,Astronomy,NaN,NaN,1,306,2,15.0,STS-122 (Atlantis),NaN,NaN
97,Joe F. Edwards Jr.,1995.0,15.0,Retired,2/3/1958,"Richmond, VA",Male,US Naval Academy; University of Tennessee-Knox...,Aerospace Engineering,Aviation Systems,Commander,US Navy (Retired),1,211,0,0.0,STS-89 (Endeavor),NaN,NaN

In [6]:
# random sample with replace

df.sample(3, replace=True)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
58,Manley Lanier Carter Jr.,1984.0,10.0,Deceased,8/15/1947,"Macon, GA",Male,Emory University,Chemistry,Medicine,Captain,US Navy,1,120,0,0.0,STS-33 (Discovery),4/5/1991,NaN
6,Joseph P. Allen,1967.0,6.0,Retired,6/27/1937,"Crawsfordsville, IN",Male,DePauw University; Yale University,Mathematics & Physics,Physics,NaN,NaN,2,313,2,12.0,"ST-5 (Columbia), STS 51-A (Discovery)",NaN,NaN
308,Nicole P. Stott,2000.0,18.0,Active,11/19/1962,"Albany, NY",Female,Embry-Riddle Aeronautical University; Universi...,Aeronautical Engineering,Engineering Management,NaN,NaN,2,2477,1,6.0,"STS-128/129 (Discovery/Atlantis), STS-133 (Dis...",NaN,NaN

In [9]:
# info of the dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 357 entries, 0 to 356
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 357 non-null    object
 1   Year                 330 non-null    float64
 2   Group                330 non-null    float64
 3   Status               357 non-null    object
 4   Birth Date           357 non-null    object
 5   Birth Place          357 non-null    object
 6   Gender               357 non-null    object
 7   Alma Mater           356 non-null    object
 8   Undergraduate Major  335 non-null    object
 9   Graduate Major       298 non-null    object
 10  Military Rank        207 non-null    object
 11  Military Branch      211 non-null    object
 12  Space Flights        357 non-null    int64
 13  Space Flight (hr)    357 non-null    int64
 14  Space Walks          357 non-null    int64
 15  Space Walks (hr)     357 non-null    float64
 16  Missions             334 non-null    object
 17  Death Date           52 non-null     object
 18  Death Mission        16 non-null     object
dtypes: float64(3), int64(3), object(13)
memory usage: 53.1+ KB

In [11]:
# describe the data

df.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,330.0,1985.106061,13.216147,1959.0,1978.0,1987.0,1996.0,2009.0
Group,330.0,11.409091,5.149962,1.0,8.0,12.0,16.0,20.0
Space Flights,357.0,2.364146,1.428700,0.0,1.0,2.0,3.0,7.0
Space Flight (hr),357.0,1249.266106,1896.759857,0.0,289.0,590.0,1045.0,12818.0
Space Walks,357.0,1.246499,2.056989,0.0,0.0,0.0,2.0,10.0
Space Walks (hr),357.0,7.707283,13.367973,0.0,0.0,0.0,12.0,67.0

In [12]:
# shape of the dataframe

df.shape

(357, 19)

In [13]:
# correlation of df columns

df.corr()

,Year,Group,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr)
Year,1.000000,0.980934,0.036420,0.331386,0.210073,0.253502
Group,0.980934,1.000000,-0.011386,0.325683,0.217891,0.261384
Space Flights,0.036420,-0.011386,1.000000,0.325233,0.257073,0.258642
Space Flight (hr),0.331386,0.325683,0.325233,1.000000,0.472796,0.454408
Space Walks,0.210073,0.217891,0.257073,0.472796,1.000000,0.985755
Space Walks (hr),0.253502,0.261384,0.258642,0.454408,0.985755,1.000000

In [14]:
# count of individual values

df["Year"].value_counts()

1996.0    35
1978.0    35
1998.0    25
1990.0    23
1966.0    19
1995.0    19
1980.0    19
1992.0    19
1984.0    18
2000.0    17
1987.0    15
1963.0    14
1985.0    13
1967.0    11
2004.0    11
2009.0     9
1962.0     8
1969.0     7
1959.0     7
1965.0     6
Name: Year, dtype: int64

In [15]:
# max of each column

df.max()

Name                 Yvonne D. Cagle
Year                            2009
Group                             20
Status                       Retired
Birth Date                  9/9/1952
Birth Place              Yonkers, NY
Gender                          Male
Space Flights                      7
Space Flight (hr)              12818
Space Walks                       10
Space Walks (hr)                  67
dtype: object

In [16]:
# min of each column

df.min()

Name                 Alan B. Shepard Jr.
Year                                 1959
Group                                   1
Status                             Active
Birth Date                      1/14/1943
Birth Place                  Abington, PA
Gender                             Female
Space Flights                           0
Space Flight (hr)                       0
Space Walks                             0
Space Walks (hr)                        0
dtype: object